#ifndef __TCP_CLIENT_H
#define __TCP_CLIENT_H
 

/********************************************************
 * 函数功能：创建TCP客户端
 * 形    参：ip_msg：IP信息数据结构指针
 * 返 回 值：0=成功
             1=TCP客户端线程创建失败
             2=TCP客户端数据列队创建失败
 ********************************************************/
unsigned int tcp_client_init(void *ip_msg);

/********************************************************
 * 函数功能：TCP客户端重连
 * 形    参：无
 * 返 回 值：0=成功
             1=失败
 ********************************************************/
unsigned int tcp_client_reconnect(void);

/********************************************************
 * 函数功能：获取TCP客户端连接状态
 * 形    参：无
 * 返 回 值：0=连接正常
             1=连接异常
 ********************************************************/
unsigned int tcp_client_connect_status_get(void);

/********************************************************
 * 函数功能：TCP客户端向网口发送数据
 * 形    参：pbuf：数据缓存地址
             length：发送数据字节数
 * 返 回 值：0=成功
             1=数据缓存地址为NULL
             2=数据长度错误
             3=客户端未启动
             4=连接异常
 ********************************************************/
unsigned int tcp_client_write(const unsigned char *pbuf, unsigned int length);

/********************************************************
 * 函数功能：获取TCP客户端数据列队句柄
 * 形    参：无
 * 返 回 值：数据列队句柄
 ********************************************************/
void *tcp_client_queue(void);
 
 
#endif
